app/Controllers/AdminController.php

SELECT `solicitudes`.*, `usuarios`.`nombre` as `nombre_usuario`, `usuarios`.`email`, `mascotas`.`nombre` as `nombre_mascota`, `mascotas`.`imagen`
FROM `solicitudes`
JOIN `usuarios` ON `usuarios`.`id` = `solicitudes`.`usuario_id`
JOIN `mascotas` ON `mascotas`.`id` = `solicitudes`.`mascota_id`
ORDER BY `solicitudes`.`id` DESC
---
    public function verSolicitudes()
    {
        $adoptionModel = new AdoptionModel();

        $solicitudes = $adoptionModel->select('solicitudes.*, usuarios.nombre as nombre_usuario, usuarios.email, mascotas.nombre as nombre_mascota, mascotas.imagen')
                                     ->join('usuarios', 'usuarios.id = solicitudes.usuario_id')
                                     ->join('mascotas', 'mascotas.id = solicitudes.mascota_id')
                                     ->orderBy('solicitudes.id', 'DESC')
                                     ->findAll();

UPDATE `mascotas` SET `estado` = 'adoptado'
WHERE `mascotas`.`id` IN ('1')
---
    public function cambiarEstadoSolicitud($id, $estado)
    {
        $adoptionModel = new AdoptionModel();

        if (in_array($estado, ['aprobada', 'rechazada'])) {
            $adoptionModel->update($id, ['estado' => $estado]);

            if($estado == 'aprobada'){
                $solicitud = $adoptionModel->find($id);
                $petModel = new PetModel();
                $petModel->update($solicitud['mascota_id'], ['estado' => 'adoptado']);

SELECT `solicitudes`.*, `usuarios`.`nombre` as `nombre_usuario`, `usuarios`.`email` as `email_usuario`, `mascotas`.`nombre` as `nombre_mascota`, `mascotas`.`imagen`, `mascotas`.`especie`, `mascotas`.`raza`, `mascotas`.`edad`, `mascotas`.`sexo`
FROM `solicitudes`
JOIN `usuarios` ON `usuarios`.`id` = `solicitudes`.`usuario_id`
JOIN `mascotas` ON `mascotas`.`id` = `solicitudes`.`mascota_id`
WHERE `solicitudes`.`id` = '4'
---
    public function verDetalleSolicitud($id)
    {
        $adoptionModel = new AdoptionModel();

        // Hacemos JOIN para traer TODOS los datos necesarios
        $solicitud = $adoptionModel->select('solicitudes.*,
                                            usuarios.nombre as nombre_usuario,
                                            usuarios.email as email_usuario,
                                            mascotas.nombre as nombre_mascota,
                                            mascotas.imagen,
                                            mascotas.especie,
                                            mascotas.raza,
                                            mascotas.edad,
                                            mascotas.sexo')
                                   ->join('usuarios', 'usuarios.id = solicitudes.usuario_id')
                                   ->join('mascotas', 'mascotas.id = solicitudes.mascota_id')
                                   ->find($id);